Обработки/Reports/_ОтчетОФинансовыхРезультатахВРазрезеАналитикиНУБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОФинансовыхРезультатахВРазрезеАналитикиНУБУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОФинансовыхРезультатахВРазрезеАналитикиНУБУ/Ext/ObjectModule.bsl
Перем НастройкиУчетаАктивов;
Перем НастройкиУчетаКомиссии;  

Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о финансовых результатах в разрезе аналитики (НУ и БУ)",
		"1.53",
		"",
		Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	Если ЗначениеЗаполнено(НастройкиОтчета.КлючТекущегоВарианта) Тогда
		КлючТекущегоВарианта = НастройкиОтчета.КлючТекущегоВарианта;
	Иначе
		КлючТекущегоВарианта = "Свернутый";
	КонецЕсли;
	
	ТекущийВариант = ЭтотОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Найти(КлючТекущегоВарианта);
    
    ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(ТекущийВариант.Настройки);
	                                                     	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица",	НастройкиОтчета.Подписант);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("РазворачиватьПоЦеннымБумагам",	НастройкиОтчета.РазворачиватьПоЦеннымБумагам);
	
	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()>0 Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();	
	КонецЕсли;		
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("ВидУчета");
	Настройки.Добавить("КлючТекущегоВарианта");
	Настройки.Добавить("РазворачиватьПоЦеннымБумагам");

	Возврат Настройки;

КонецФункции

Процедура ИнициализацияПеременных(ПоВидуУчета, СчетДУ)	
	
	ЗапросНастройкиУчетаАктивов = Новый Запрос;
	ЗапросНастройкиУчетаАктивов.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаАктивовСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов КАК АналитикаДоходов,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов
	|			ТОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаДоходовОтРеализации,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов
	|				И НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации
	|			ТОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаДоходовПоследнееПогашение,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов
	|				И НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации
	|				И НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки <> НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение
	|			ТОГДА НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаДоходовОтПереоценки,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаПерекурсовки КАК АналитикаПерекурсовки,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовИндексацииНоминала КАК АналитикаДоходовИндексацииНоминала,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПогашенияИндексируемогоНоминала КАК АналитикаДоходовПогашенияИндексируемогоНоминала
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&ОтчетнаяДата,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления В (&СчетДУ)
	|				И ВидУчета = &ВидУчета) КАК НастройкиУчетаАктивовСрезПоследних";
	
	ЗапросНастройкиУчетаАктивов.УстановитьПараметр("СчетДУ", СчетДУ);
	ЗапросНастройкиУчетаАктивов.УстановитьПараметр("Организация", Организация);
	ЗапросНастройкиУчетаАктивов.УстановитьПараметр("ОтчетнаяДата", КонецДня(Период.ДатаОкончания));
	ЗапросНастройкиУчетаАктивов.УстановитьПараметр("ВидУчета", ПоВидуУчета);
	
	НастройкиУчетаАктивов = ЗапросНастройкиУчетаАктивов.Выполнить().Выгрузить();	
	
	
	ЗапросНастройкиУчетаКомиссии = Новый Запрос;
	ЗапросНастройкиУчетаКомиссии.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаКомиссииСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НастройкиУчетаКомиссииСрезПоследних.ВидЗадолженности КАК ВидЗадолженности,
	|	НастройкиУчетаКомиссииСрезПоследних.Аналитика КАК Аналитика,
	|	НастройкиУчетаКомиссииСрезПоследних.АналитикаРЕПО КАК АналитикаРЕПО
	|ИЗ
	|	РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
	|			&ОтчетнаяДата,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления В (&СчетДУ)
	|				И ВидУчета = &ВидУчета) КАК НастройкиУчетаКомиссииСрезПоследних";
	
	ЗапросНастройкиУчетаКомиссии.УстановитьПараметр("СчетДУ", СчетДУ);
	ЗапросНастройкиУчетаКомиссии.УстановитьПараметр("Организация", Организация);
	ЗапросНастройкиУчетаКомиссии.УстановитьПараметр("ОтчетнаяДата", КонецДня(Период.ДатаОкончания));
	ЗапросНастройкиУчетаКомиссии.УстановитьПараметр("ВидУчета", ПоВидуУчета);
	
	НастройкиУчетаКомиссии = ЗапросНастройкиУчетаКомиссии.Выполнить().Выгрузить();	
	
КонецПроцедуры	

Функция ПолучитьСтатьюДоходаРасходаИзНастройки(МестоХраненияНастройки, УчетныйАктив, ВидАналитики, СчетДУ)
	
	Если МестоХраненияНастройки <> "ПоКоду" Тогда
		Если ПустаяСтрока(УчетныйАктив) ИЛИ ПустаяСтрока(ВидАналитики) Тогда 
			ПрочиеДоходыРасходы = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
			Возврат ПрочиеДоходыРасходы;
		КонецЕсли;	
	КонецЕсли;
	
	Если МестоХраненияНастройки = "НастройкиУчетаАктивов" Тогда 		
		
		
		Актив = Справочники.УчетныеАктивы[СокрЛП(УчетныйАктив)];
		
		Колонка = НастройкиУчетаАктивов.Колонки.Найти(ВидАналитики);
		
		Отбор = Новый Структура("СчетДоверительногоУправления, УчетныйАктив", СчетДУ, Актив); 
		НайденныеСтроки = НастройкиУчетаАктивов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()>0 Тогда 
			ПрочиеДоходыРасходы = НайденныеСтроки[0][Колонка.Имя];
		Иначе
			ПрочиеДоходыРасходы = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
		КонецЕсли;	
				
		Возврат ПрочиеДоходыРасходы;
	ИначеЕсли МестоХраненияНастройки = "НастройкиУчетаКомиссии" Тогда 
		
		Актив = Справочники.ВидыЗадолженности[СокрЛП(УчетныйАктив)];
		
		Отбор = Новый Структура("СчетДоверительногоУправления, ВидЗадолженности", СчетДУ, Актив); 
		НайденныеСтроки = НастройкиУчетаАктивов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()>0 Тогда 
			ПрочиеДоходыРасходы = НайденныеСтроки[0][ВидАналитики];
		Иначе
			ПрочиеДоходыРасходы = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
		КонецЕсли;	
				
		Возврат ПрочиеДоходыРасходы;
		
	ИначеЕсли МестоХраненияНастройки = "НастройкиУчетаОбщие" Тогда 
		
	ИначеЕсли МестоХраненияНастройки = "ПоКоду" Тогда 
				
		ПрочиеДоходыРасходы = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду(СокрЛП(УчетныйАктив));
		Возврат ПрочиеДоходыРасходы;
		
	КонецЕсли;
		
КонецФункции	

Функция СчитатьТабличныйДокументВТаблицуЗначений(ИмяМакета, Заголовки, Строки);
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	ОбластьЗаголовки = Макет.ПолучитьОбласть(Заголовки);
	ОбластьДанные = Макет.ПолучитьОбласть(Строки);
	
	Рез = Новый ТаблицаЗначений;
	
	Если ОбластьЗаголовки.ВысотаТаблицы > 1 Тогда 
		Сообщить("Неправильная структура секции заголовков в Макете " + ИмяМакета);
		Возврат Рез;
	КонецЕсли;	
	
	КоличествоКолонок = ОбластьЗаголовки.ШиринаТаблицы;
	КоличествоСтрок = ОбластьДанные.ВысотаТаблицы;
	
	Для инд = 1 по КоличествоКолонок Цикл 
		Рез.Колонки.Добавить(ОбластьЗаголовки.ПолучитьОбласть(1, инд).ТекущаяОбласть.Текст);
	КонецЦикла;	
		
	Для индСтроки = 1 по КоличествоСтрок Цикл 
		НоваяСтрока = Рез.Добавить();
		Для индКолонки = 1 по КоличествоКолонок Цикл 
			НоваяСтрока[ИндКолонки-1] = ОбластьДанные.ПолучитьОбласть(индСтроки, индКолонки).ТекущаяОбласть.Текст;		
		КонецЦикла;	
	КонецЦикла;		

	Возврат Рез;
	
КонецФункции	

Процедура Преобразовать(ТаблицаНастройки, СчетДУ, ТаблицаНастройкаИтоговая)
	
	//преобразование значений в удобные типы
	
	ТаблицаНастройки.Колонки.Добавить("ПрочиеДоходыРасходы");	
	
	Для Каждого СтрокаТЗ из ТаблицаНастройки Цикл 
		
		Если СтрокаТЗ.ПризнакОРЦБ = "Обращается" Тогда
			СтрокаТЗ.ПризнакОРЦБ = Перечисления.ВидыОбращенияНаОРЦБ.Обращается;
		ИначеЕсли СтрокаТЗ.ПризнакОРЦБ= "НеОбращается" Тогда	
			СтрокаТЗ.ПризнакОРЦБ = Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается;
		Иначе	
			СтрокаТЗ.ПризнакОРЦБ = Перечисления.ВидыОбращенияНаОРЦБ.ПустаяСсылка();
		КонецЕсли;	
		СтрокаТЗ.ПрочиеДоходыРасходы = ПолучитьСтатьюДоходаРасходаИзНастройки(СтрокаТЗ.Регистр, СтрокаТЗ.УчетныйАктив, СтрокаТз.Аналитика, СчетДУ);
		
	КонецЦикла;

	МассивКолонок = Новый Массив;
	Для Каждого Колонка из ТаблицаНастройки.Колонки Цикл 
		Если Колонка.Имя <> "УчетныйАктив" Тогда 
			МассивКолонок.Добавить(Колонка.Имя);
		КонецЕсли;			
	КонецЦикла;	
	ТаблицаНастройки.Свернуть(СтрСоединить(МассивКолонок, ","));	
	
	Если ТаблицаНастройкаИтоговая = Неопределено Тогда 
		ТаблицаНастройкаИтоговая = ТаблицаНастройки.Скопировать();
		ТаблицаНастройкаИтоговая.Колонки.Добавить("СчетДоверительногоУправления");
		ТаблицаНастройкаИтоговая.ЗаполнитьЗначения(СчетДУ, "СчетДоверительногоУправления"); 
	Иначе
		Для Каждого СтрокаНастройка из ТаблицаНастройки Цикл 
			НоваяСтрока = ТаблицаНастройкаИтоговая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройка);
			НоваяСтрока.СчетДоверительногоУправления = СчетДУ;
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры	

Функция ЗапросДоходыРасходы(ВидУчета, СчетДУ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	РегистрОбороты.Счет КАК Счет,
		|	РегистрОбороты.Субконто1 КАК Субконто1,
		|	РегистрОбороты.Субконто2 КАК Субконто2,
		|	РегистрОбороты.Субконто3 КАК Субконто3,
		|	РегистрОбороты.СуммаОборотДт КАК СуммаОборотДт
		|ПОМЕСТИТЬ _Расходы
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетДУ),
		|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ФинансовыеВложения))
		|				ИЛИ КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)),
		|			) КАК РегистрОбороты
		|ГДЕ
		|	РегистрОбороты.Субконто1 В
		|			(ВЫБРАТЬ
		|				НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации КАК АналитикаДоходовОтРеализации
		|			ИЗ
		|				РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(&ДатаКонечная, Организация = &Организация
		|					И СчетДоверительногоУправления В (&СчетДУ)
		|					И ВидУчета = ЗНАЧЕНИЕ(ПЕречисление.ВидыУчета.НалоговыйУчет)) КАК НастройкиУчетаАктивовСрезПоследних
		|			ГДЕ
		|				НастройкиУчетаАктивовСрезПоследних.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Акции), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.АкцииИностранныхЭмитентов), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ПаиИностранныхЭмитентов), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративные), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Еврооблигации)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	РегистрОстаткиИОбороты.Счет КАК Счет,
		|	РегистрОстаткиИОбороты.Субконто1 КАК ПрочиеДоходыРасходы,
		|	РегистрОстаткиИОбороты.Субконто2 КАК ЦенныеБумаги,
		|	РегистрОстаткиИОбороты.Субконто3 КАК ОбращаетсяНаОРЦБ,
		|	0 КАК СуммаНачальныйОстатокДт,
		|	РегистрОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
		|	0 КАК СуммаОборотДт,
		|	РегистрОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
		|	0 КАК СуммаКонечныйОстатокДт,
		|	РегистрОстаткиИОбороты.СуммаНачальныйОстатокКт + РегистрОстаткиИОбороты.СуммаОборотКт КАК СуммаКонечныйОстатокКт
		|ПОМЕСТИТЬ _Доходы
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.ОстаткиИОбороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетДУ)) КАК РегистрОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РегистрОстаткиИОбороты.СчетДоверительногоУправления,
		|	РегистрОстаткиИОбороты.Счет,
		|	РегистрОстаткиИОбороты.Субконто1,
		|	РегистрОстаткиИОбороты.Субконто2,
		|	РегистрОстаткиИОбороты.Субконто3,
		|	РегистрОстаткиИОбороты.СуммаНачальныйОстатокДт,
		|	0,
		|	РегистрОстаткиИОбороты.СуммаОборотДт,
		|	0,
		|	РегистрОстаткиИОбороты.СуммаНачальныйОстатокДт + РегистрОстаткиИОбороты.СуммаОборотДт,
		|	0
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.ОстаткиИОбороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетДУ)) КАК РегистрОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Доходы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Доходы.Счет КАК Счет,
		|	_Доходы.ПрочиеДоходыРасходы КАК ПрочиеДоходыРасходы,
		|	_Доходы.ЦенныеБумаги КАК ЦенныеБумаги,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Акции)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Акции).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Акции).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Векселя)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Векселя).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Векселя).Номер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Векселя).Номер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Векселя).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Доли)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Доли).ЮрЛицо.Наименование) + "", "" + ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Доли).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Облигации)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Облигации).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Паи)
		|			ТОГДА """" + РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Паи).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|			ТОГДА """" + ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|		ИНАЧЕ _Доходы.ЦенныеБумаги.Наименование
		|	КОНЕЦ КАК ЦенныеБумагиНаименование,
		|	_Доходы.ОбращаетсяНаОРЦБ КАК ОбращаетсяНаОРЦБ,
		|	_Доходы.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
		|	_Доходы.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
		|	_Доходы.СуммаОборотДт КАК СуммаОборотДт,
		|	_Доходы.СуммаОборотКт КАК СуммаОборотКт,
		|	_Доходы.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
		|	_Доходы.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
		|	ЕСТЬNULL(_Расходы.СуммаОборотДт, 0) КАК Расходы
		|ИЗ
		|	_Доходы КАК _Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Расходы КАК _Расходы
		|		ПО _Доходы.СчетДоверительногоУправления = _Расходы.СчетДоверительногоУправления
		|			И _Доходы.Счет = _Расходы.Счет
		|			И _Доходы.ПрочиеДоходыРасходы = _Расходы.Субконто1
		|			И _Доходы.ЦенныеБумаги = _Расходы.Субконто2
		|			И _Доходы.ОбращаетсяНаОРЦБ = _Расходы.Субконто3
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаКонечная,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаКонечная, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО _Доходы.ЦенныеБумаги = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаКонечная, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Доходы.ЦенныеБумаги) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(_Доходы.ЦенныеБумаги КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаКонечная, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО _Доходы.ЦенныеБумаги = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект";
	
	Если ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", "БухгалтерскийУчет");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("СчетДУ", СчетДУ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачальная", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонечная", Новый Граница(Период.ДатаОкончания, ВидГраницы.Включая));
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;	
	
КонецФункции	
	
Процедура ДобавитьДанныеВОтчет(ТаблицаОтчета, СтрокаТаблицыРезультов, Код="40.9", ГрафаРасход="",ГрафаПриход="")
	
	// Код="40.1", ГрафаРасход="",ГрафаПриход=""
	// по умолчанию - прочие доходы расходы
	
	СтрокаОтчета = ТаблицаОтчета.Добавить();
		
	СтрокаОтчета.Код = Код;
	СтрокаОтчета.ПрочиеДоходыИРасходы = СтрокаТаблицыРезультов.ПрочиеДоходыРасходы;
	СтрокаОтчета.ЦеннаяБумага 				= СтрокаТаблицыРезультов.ЦенныеБумаги;
	СтрокаОтчета.ЦеннаяБумагаНаименование 	= СтрокаТаблицыРезультов.ЦенныеБумагиНаименование;
	СтрокаОтчета.СчетДоверительногоУправления = СтрокаТаблицыРезультов.СчетДоверительногоУправления;
	
	//начало
	СтрокаОтчета.РасходыНП = СтрокаТаблицыРезультов.СуммаНачальныйОстатокДт;
	СтрокаОтчета.ДоходыНП = СтрокаТаблицыРезультов.СуммаНачальныйОстатокКт;	
	//обороты
	Если ГрафаРасход = "СебестоимостьВыбытия" Тогда
		СтрокаОтчета.СебестоимостьВыбытия = СтрокаТаблицыРезультов.СуммаОборотДт;
		СтрокаОтчета.СебестоимостьВыбытия = СтрокаОтчета.СебестоимостьВыбытия - СтрокаТаблицыРезультов.Расходы;
		СтрокаОтчета.РасходыРеализация = СтрокаТаблицыРезультов.Расходы;
	Иначе
		СтрокаОтчета.ПрочиеРасходы = СтрокаТаблицыРезультов.СуммаОборотДт;
	КонецЕсли;	
	
	Если ГрафаРасход = "СебестоимостьВыбытия" Тогда
		СтрокаОтчета.ВыручкаРеализация = СтрокаТаблицыРезультов.СуммаОборотКт;
	Иначе
		СтрокаОтчета.ПрочиеДоходы = СтрокаТаблицыРезультов.СуммаОборотКт;
	КонецЕсли;	
	
	//конец
	СтрокаОтчета.РасходыКП = СтрокаТаблицыРезультов.СуммаКонечныйОстатокДт;
	СтрокаОтчета.ДоходыКП = СтрокаТаблицыРезультов.СуммаКонечныйОстатокКт;	

КонецПроцедуры	

Функция ВходитВФильтр(вхЦеннаяБумага, Фильтр)
	
	Если ПустаяСтрока(Фильтр) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	
	Если Фильтр = "Корпоративные20" Тогда 
		Если ТипЗнч(вхЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда 
			Если вхЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда 
				Если вхЦеннаяБумага.ДатаНачалаРазмещения < Дата(2017,1,1) Тогда 
					Возврат Истина;
				КонецЕсли;					
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли Фильтр = "Корпоративные15" Тогда 
		Если ТипЗнч(вхЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда 
			Если вхЦеннаяБумага.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда 
				Если вхЦеннаяБумага.ДатаНачалаРазмещения >= Дата(2017,1,1) Тогда 
					Возврат Истина;
				КонецЕсли;	
		    КонецЕсли;			
		КонецЕсли;			
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции	

Процедура РаспределениеРезультата(ТаблицаОтчета, ТаблицаРезультат, ТаблицаНастройки)
	
	ТаблицаРезультат.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаТаблицыНастроек Из ТаблицаНастройки Цикл 
		
		Отбор = Новый Структура;
		Отбор.Вставить("ПрочиеДоходыРасходы", СтрокаТаблицыНастроек.ПрочиеДоходыРасходы);
		Отбор.Вставить("СчетДоверительногоУправления", СтрокаТаблицыНастроек.СчетДоверительногоУправления);
		Если СтрокаТаблицыНастроек.ПризнакОРЦБ <> Перечисления.ВидыОбращенияНаОРЦБ.ПустаяСсылка() Тогда
			Отбор.Вставить("ОбращаетсяНаОРЦБ", СтрокаТаблицыНастроек.ПризнакОРЦБ);
		КонецЕсли;
		Отбор.Вставить("Используется", Ложь);      // если два вида актива (гос и гос в валюте) используют одну статью дохода, задвоения не будет 
		
		НайденныеСтроки =  ТаблицаРезультат.НайтиСтроки(Отбор);
		Для Каждого СтрокаТаблицыРезультов Из НайденныеСтроки Цикл 
			
			Если НЕ ПустаяСтрока(СтрокаТаблицыНастроек.Счет) Тогда 
				Если СокрЛП(СтрокаТаблицыНастроек.Счет) <> СтрокаТаблицыРезультов.Счет.Код Тогда 
					Продолжить;
				КонецЕсли; 
				//сделано для индексируемого номинала. Доход 15%, Расход 20%
			КонецЕсли;	
			
			//УсловиеКоррСчет = ФильтрКоррСчет(СтрокаТаблицыРезультов.КорСчет,СтрокаТаблицыНастроек.ФильтрКорСчет); 
			УсловиеЦеннаяБумага = ВходитВФильтр(СтрокаТаблицыРезультов.ЦенныеБумаги, СтрокаТаблицыНастроек.Фильтр);  
			//УсловиеРегистратор = ФильрДок(СтрокаТаблицыРезультов.Регистратор, СтрокаТаблицыНастроек.ФильтрДок);
			
			//Если УсловиеКоррСчет И УсловиеЦеннаяБумага И УсловиеРегистратор Тогда 
			Если УсловиеЦеннаяБумага Тогда 
				СтрокаТаблицыРезультов.Используется = Истина;
				ДобавитьДанныеВОтчет(ТаблицаОтчета, СтрокаТаблицыРезультов, СтрокаТаблицыНастроек.Код, СтрокаТаблицыНастроек.ГрафаРасход, СтрокаТаблицыНастроек.ГрафаПриход);			
			КонецЕсли;				
		КонецЦикла;		
	КонецЦикла;	
		
	Для Каждого СтрокаТаблицыРезультов из ТаблицаРезультат Цикл
		Если СтрокаТаблицыРезультов.Используется Тогда 
			Продолжить;
		КонецЕсли;		
		ДобавитьДанныеВОтчет(ТаблицаОтчета, СтрокаТаблицыРезультов);			
	КонецЦикла;
	
КонецПроцедуры 

Процедура РассчитатьИтоги(ТаблицаОтчета, ТаблицаГруппировок)
	
	Для Каждого СтрокаТаблицаОтчета из ТаблицаОтчета Цикл
		
		СтрокаГруппировки = ТаблицаГруппировок.Найти(СтрокаТаблицаОтчета.Код, "Код");
		Если СтрокаГруппировки<>Неопределено Тогда 
			СтрокаТаблицаОтчета.Группировка2 = СтрокаГруппировки.Группа2;
			СтрокаТаблицаОтчета.Группировка1 = СтрокаГруппировки.Группа1;
			СтрокаТаблицаОтчета.Ставка = Число(СтрокаГруппировки.Ставка);
		Иначе
			Сообщить("Ошибка распределения по группам");
		КонецЕсли;	
		
		Если ТипЗнч(СтрокаТаблицаОтчета.ЦеннаяБумага) = Тип("ДокументСсылка.МНО") Тогда 	
			СтрокаТаблицаОтчета.ЦеннаяБумага = "";   //МНО, Депозиты и прочее. Расшифровка не нужна
		КонецЕсли;
		
	КонецЦикла;		
	
	ИтоговыеСтроки = "РасходыНП, ДоходыНП, УбытокНП, ПрибыльНП, РезНачало,";
	ИтоговыеСтроки = ИтоговыеСтроки + "СебестоимостьВыбытия, РасходыРеализация, ПрочиеРасходы, ИтогоРасходы,";
	ИтоговыеСтроки = ИтоговыеСтроки + "ВыручкаРеализация, ПрочиеДоходы, ИтогоДоходы, Убыток, Прибыль,РезПериод,";
	ИтоговыеСтроки = ИтоговыеСтроки + "РасходыКП, ДоходыКП, УбытокКП, ПрибыльКП,РезКонец";
	
	
	ТаблицаОтчета.Свернуть("Группировка1,Группировка2,Код,ПрочиеДоходыИРасходы, СчетДоверительногоУправления, ЦеннаяБумага, ЦеннаяБумагаНаименование, Ставка",ИтоговыеСтроки);	
	ТаблицаОтчета.Сортировать("Код, ПрочиеДоходыИРасходы, ЦеннаяБумага");
	
	//вычисляемые поля
	Для каждого СтрокаТаблицаОтчета из ТаблицаОтчета Цикл 
		
		СтрокаТаблицаОтчета.РезНачало = СтрокаТаблицаОтчета.ДоходыНП - СтрокаТаблицаОтчета.РасходыНП;
		Если СтрокаТаблицаОтчета.РезНачало >0 Тогда 
			СтрокаТаблицаОтчета.ПрибыльНП = СтрокаТаблицаОтчета.РезНачало;
		Иначе
			СтрокаТаблицаОтчета.УбытокНП = - СтрокаТаблицаОтчета.РезНачало;
		КонецЕсли;	
		
		СтрокаТаблицаОтчета.РезКонец = СтрокаТаблицаОтчета.ДоходыКП - СтрокаТаблицаОтчета.РасходыКП;
		Если СтрокаТаблицаОтчета.РезКонец >0 Тогда 
			СтрокаТаблицаОтчета.ПрибыльКП = СтрокаТаблицаОтчета.РезКонец;
		Иначе
			СтрокаТаблицаОтчета.УбытокКП = - СтрокаТаблицаОтчета.РезКонец;
		КонецЕсли;	
		
		СтрокаТаблицаОтчета.ИтогоРасходы = СтрокаТаблицаОтчета.СебестоимостьВыбытия + СтрокаТаблицаОтчета.РасходыРеализация + СтрокаТаблицаОтчета.ПрочиеРасходы;
		СтрокаТаблицаОтчета.ИтогоДоходы = СтрокаТаблицаОтчета.ВыручкаРеализация + СтрокаТаблицаОтчета.ПрочиеДоходы;
		
		СтрокаТаблицаОтчета.РезПериод = СтрокаТаблицаОтчета.ИтогоДоходы - СтрокаТаблицаОтчета.ИтогоРасходы;
		Если СтрокаТаблицаОтчета.РезПериод >0 Тогда 
			СтрокаТаблицаОтчета.Прибыль = СтрокаТаблицаОтчета.РезПериод;
		Иначе
			СтрокаТаблицаОтчета.Убыток = - СтрокаТаблицаОтчета.РезПериод;
		КонецЕсли;	
				
	КонецЦикла;	
	
	
КонецПроцедуры

Функция НайтиИдНастройки(Знач Настройки, ИмяНастройки)
	
	Результат = Неопределено;	
	Для Каждого Элемент из Настройки Цикл 
		Если Элемент.Имя = ИмяНастройки Тогда 
			Результат = Элемент.ИдентификаторПользовательскойНастройки;
		КонецЕсли;	
		Если Результат = Неопределено Тогда 
			Если Элемент.Структура <> Неопределено Тогда 
				Результат = НайтиИдНастройки(Элемент.Структура, ИмяНастройки);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

Функция СформироватьТаблицуОтчета(ПоВидуУчета, СписокСчетовДУ)
	Перем ТаблицаНастройкаИтоговая;
		
	ИнициализацияПеременных(ПоВидуУчета, СписокСчетовДУ);
	
	КвалЧисло = Новый КвалификаторыЧисла(19.2);
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	ТаблицаОтчета = Новый ТаблицаЗначений;
	
	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Тип("СправочникСсылка.Акции"));
	МассивВидов.Добавить(Тип("СправочникСсылка.БанковскиеСчета"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.ВалютныеПары"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.Векселя"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.ДепозитарныеРасписки"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.ДепозитныеВклады"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.Доли"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.Займы"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.ИпотечныеСертификатыУчастия"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.Облигации"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.Паи"));	
	МассивВидов.Добавить(Тип("СправочникСсылка.ПроизводныеФинансовыеИнструменты"));	
	
	//группировки
	ТаблицаОтчета.Колонки.Добавить("Группировка1");
	ТаблицаОтчета.Колонки.Добавить("Группировка2");
	ТаблицаОтчета.Колонки.Добавить("ПрочиеДоходыИРасходы");
	ТаблицаОтчета.Колонки.Добавить("ЦеннаяБумага", Новый ОписаниеТипов(МассивВидов));
	
	//вспомогательное поле. По этому полю будем потом проставлять группировки
	ТаблицаОтчета.Колонки.Добавить("Код");
	// налоговая ставка 20/15/9. Нужно для выделения справочной секции 
	ТаблицаОтчета.Колонки.Добавить("Ставка", ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ЦеннаяБумагаНаименование");
	
	//Колонки
	ТаблицаОтчета.Колонки.Добавить("РасходыНП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ДоходыНП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("УбытокНП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ПрибыльНП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("РезНачало",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("СебестоимостьВыбытия",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("РасходыРеализация",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ПрочиеРасходы",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ИтогоРасходы",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ВыручкаРеализация",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ПрочиеДоходы",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ИтогоДоходы",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("Убыток",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("Прибыль",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("РезПериод",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("РасходыКП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ДоходыКП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("УбытокКП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("ПрибыльКП",ТипЧисло);
	ТаблицаОтчета.Колонки.Добавить("РезКонец",ТипЧисло);	
	ТаблицаОтчета.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));	
	
	Если ПоВидуУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда 
		ТаблицаГруппировок = СчитатьТабличныйДокументВТаблицуЗначений("НастройкаОтчетОФинрезультатахНУ","ЗаголовкиГруппы|КолонкиГруппы", "СтрокиГруппы|КолонкиГруппы");		
		ТаблицаНастройкиФЛ = СчитатьТабличныйДокументВТаблицуЗначений("НастройкаОтчетОФинрезультатахНУ","ЗаголовкиМакет|КолонкиНастройки", "СтрокиМакетФЛ|КолонкиНастройки");		
		ТаблицаНастройкиЮЛ = СчитатьТабличныйДокументВТаблицуЗначений("НастройкаОтчетОФинрезультатахНУ","ЗаголовкиМакет|КолонкиНастройки", "СтрокиМакет|КолонкиНастройки");
	ИначеЕсли ПоВидуУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
		ТаблицаГруппировок = СчитатьТабличныйДокументВТаблицуЗначений("НастройкаОтчетОФинрезультатахБУ","ЗаголовкиГруппы|КолонкиГруппы", "СтрокиГруппы|КолонкиГруппы");
		ТаблицаНастройкиЮЛ = СчитатьТабличныйДокументВТаблицуЗначений("НастройкаОтчетОФинрезультатахБУ","ЗаголовкиМакет|КолонкиНастройки", "СтрокиМакет|КолонкиНастройки");	
	КонецЕсли;
	
	Для Каждого СчетДУ из СписокСчетовДУ Цикл 
		Если ПоВидуУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда 
			Если СчетДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица 
				ИЛИ СчетДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда 
				ТаблицаНастройки = ТаблицаНастройкиФЛ.Скопировать();
			Иначе
				ТаблицаНастройки = ТаблицаНастройкиЮЛ.Скопировать();
			КонецЕсли;
		Иначе
			ТаблицаНастройки = ТаблицаНастройкиЮЛ.Скопировать();
		КонецЕсли;	
		Преобразовать(ТаблицаНастройки, СчетДУ, ТаблицаНастройкаИтоговая);
	КонецЦикла;	
	
	ТаблицаРезультат = ЗапросДоходыРасходы(ПоВидуУчета, СписокСчетовДУ);	
	РаспределениеРезультата(ТаблицаОтчета, ТаблицаРезультат, ТаблицаНастройкаИтоговая);
	РассчитатьИтоги(ТаблицаОтчета, ТаблицаГруппировок);

	Возврат ТаблицаОтчета;
	
КонецФункции	

Функция ПолучитьСписокСчетовДУ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет КАК ВестиБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&Период, Организация = &Организация) КАК НастройкиУчетаОбщиеСрезПоследних
	|ГДЕ
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет";
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВестиБухгалтерскийУчет", "ВестиНалоговыйУчет");		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса.ВыгрузитьКолонку("СчетДоверительногоУправления");
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Перем СписокЦенныхБумаг;
	Перем ФильтрЦБ;
	Перем РазворачиватьПоЦеннымБумагам;
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("РазворачиватьПоЦеннымБумагам", РазворачиватьПоЦеннымБумагам);	
	
	ЕстьОтборПоСчетамДУ = Ложь;
	Если ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПустаяСсылка() Тогда
		ЕстьОтборПоСчетамДУ = Истина;
	КонецЕсли;
		
	Для Каждого Элемент из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		Если (Найти(Элемент.ЛевоеЗначение, "СчетДоверительногоУправления") = 1) Тогда 			
			ЕстьОтборПоСчетамДУ = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Если ЕстьОтборПоСчетамДУ Тогда 
	ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПустаяСсылка();
		СписокСчетовДУ = ПолучитьСписокСчетовДУ();
	Иначе	
		СписокСчетовДУ = Новый Массив;
		СписокСчетовДУ.Добавить(ЭтотОбъект.СчетДоверительногоУправления);
	КонецЕсли;	
	
	ТаблицаОтчета = СформироватьТаблицуОтчета(ЭтотОбъект.ВидУчета, СписокСчетовДУ);
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаОтчета", ТаблицаОтчета);
	
	Для Каждого ГруппировкаКомпановки ИЗ ЭтотОбъект.КомпоновщикНастроек.Настройки.Структура Цикл 
		Если ГруппировкаКомпановки.Имя = "СекцияСтавкаНалогообложения" Тогда 
			Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда 
				ГруппировкаКомпановки.Использование = Ложь;
			ИначеЕсли ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда 
				ГруппировкаКомпановки.Использование = Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
		
	Настройки = КомпоновщикНастроек.Настройки;
	
	ИдРазворачивать = НайтиИдНастройки(Настройки.Структура, "ЦеннаяБумага");
	ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдРазворачивать);	
	Если РазворачиватьПоЦеннымБумагам <> Неопределено Тогда 
		ПараметрПользовательскойНастройки.Использование = РазворачиватьПоЦеннымБумагам;
	КонецЕсли;		
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", 				Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", 				Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидУчета", 					ЭтотОбъект.ВидУчета);
	
	ДанныеШапки = ПолучитьДанныеШапки();
	Если НЕ ДанныеШапки = Неопределено Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеОрганизации", 	ДанныеШапки.НаименованиеОрганизации);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеСчетаДУ", 		ДанныеШапки.НаименованиеСчетаДУ);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаДоговора", 				Формат(ДанныеШапки.ДатаДоговора, "ДФ=dd.MM.yyyy"));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 				ДанныеШапки.НомерДоговора);		
	Иначе 	
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеОрганизации", 	"");
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеСчетаДУ", 		"");
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаДоговора", 				"");
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 				"");				
	КонецЕсли; 
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект,ДокументРезультат,ДанныеРасшифровки,СтандартнаяОбработка,ПараметрыВыводаПодписей,,,ВнешниеНаборыДанных);
	
	ДокументРезультат.ФиксацияСверху = 11;	
	ДокументРезультат.ФиксацияСлева = 1;		
	
КонецПроцедуры

Функция ПолучитьДанныеШапки()

	НаименованияКлиента = РаботаСОтчетами.ПолноеИКраткоеНаименованиеКлиентаДляДокументов(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения
		|ПОМЕСТИТЬ _КлиентДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентДУ.НомерДоговора КАК НомерДоговора,
		|	_КлиентДУ.ДатаЗаключения КАК ДатаДоговора,
		|	&НаименованиеКлиента КАК НаименованиеСчетаДУ,
		|	РеквизитыОрганизацийСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации
		|ИЗ
		|	_КлиентДУ КАК _КлиентДУ,
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ЮрФизЛицоОрганизации) КАК РеквизитыОрганизацийСрезПоследних";
		
	Запрос.УстановитьПараметр("Период", 						ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации", 			ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("НаименованиеКлиента", 			
	?(ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица 
		ИЛИ ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, 
			НаименованияКлиента.ПолноеНаименование, 
			НаименованияКлиента.КраткоеНаименование));
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
		Возврат ВыборкаДетальныеЗаписи;          		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
